SoapTest/soap_config/9.activate_account.txt

<?xml version="1.0" encoding="UTF-8"?>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Body>

<SubmitRequest xmlns="http://alcatel-lucent.com/esm/ws/svcmgr/V2_0">
    <SessionInfo>
        <sessionId>213824</sessionId>
    </SessionInfo>

    <RequestInfo>
        <ReqID></ReqID>
    </RequestInfo>


    <TaskList>
        <Task>
            <Name>Activate Account</Name>
            <ParamList>
                <Param>
                    <Name>Account ID</Name>
                    <Value>886906000018</Value>
                </Param>
               <Param>
                    <Name>Next State Primary Balance</Name>
                    <Value>ACTIVE</Value>
                </Param>
                <Param>
                    <Name>Transaction ID</Name>
                    <Value>MsgSoap009</Value>
                </Param>
            </ParamList>
        </Task>
    </TaskList>
</SubmitRequest>


</S:Body>
</S:Envelope>


